/* Rexx */
/********************************************
* PROFILE EXEC written by VINCENT F. MANZO  *
*             AUG 11 2022                   *
*  SAMPLE AUTO IPL PROFILE EXEC FOR GUESTS  *
*********************************************/
'CP SET RUN ON'
'CP TERM MORE 0 0'
'CP IPL (iplvolid)'